USE mans_frends;


INSERT animals VALUES
(1, "Chakie", "2020-02-02", "m", "pets"),
(2, "Mike", "2015-11-01", "f", "pets"),
(3, "Mike", "2017-10-11", "f", "pets"),
(4, "Bob", "2010-08-01", "m", "packs"),
(5, "Васька", "2015-06-06", "m", "pets"),
(6, "Мурзик", "2022-05-15", "m", "pets"),
(7, "Охра", "2009-06-22", "f", "packs"),
(8, "Горленка", "2013-12-02", "f", "packs"),
(9, "Орион", "2005-04-04", "m", "packs"),
(10, "Mario", "2008-08-06", "m", "packs"),
(11, "Lary", "2013-09-11", "m", "pets"),
(12, "Гром", "2010-03-30","m", "pets"),
(13, "Савоя", "2020-05-06", "f", "packs"),
(14, "Габой", "2016-03-08", "m", "packs"),
(15, "Апельсинка", "2016-05-03", "m", "packs"),
(16, "Нолик", "2019-04-11", "m", "packs"),
(17, "Сандра", "2019-11-30", "f", "packs"),
(18, "Мантра", "2018-08-22", "f", "packs"),
(19, "Мигель", "2017-07-07", "m", "packs"),
(20, "Стейси", "2017-06-30", "f", "packs"),
(21, "Джун", "2022-06-06", "m", "pets"),
(22, "Мидл", "2021-08-16", "m", "pets"),
(23, "Лид", "2023-01-14",  "m", "pets"),
(24, "Сеньора", "2022-06-06", "f", "pets"),
(25, "HR", "2021-12-25", "f", "pets"),
(26, "Тефтелька", "2015-04-30", "f", "pets"),
(27, "Дара", "2013-07-08", "f", "pets"),
(28, "Гера", "2016-06-22", "f", "pets"),
(29, "Мурка", "2017-03-03", "f", "pets"),
(30, "Антрикот", "2007-11-06", "m", "pets"),
(31, "Марсик", "2016-02-28", "m", "pets"),
(32, "Гримм", "2016-05-05", "m", "pets"),
(33, "Соус", "2017-07-29",  "m", "pets"),
(34, "Дартс", "2020-09-21",  "m", "pets"),
(35, "Баунти", "2018-07-10", "f", "pets"),
(36, "Токса", "2013-03-05", "f", "pets"),
(37, "Герман", "2020-03-16", "m", "pets"),
(38, "Филя", "2015-02-25", "m", "pets"),
(39, "Бим", "2010-01-13", "m", "pets");



SELECT count(*) FROM animals WHERE species="pets";

INSERT pack_animals VALUES
(100, 150, 100,220,4),
(101, 75, 165, 390, 7),
(102, 85, 175, 430, 8),
(103, 100, 180, 500, 9),
(104, 130, 140,330,10),
(105, 75, 165, 400,13),
(106, 180,200,650,14),
(107, 150, 130, 300,15),
(108, 140, 140,350,16),
(109, 200, 180, 660, 17),
(110, 65, 160, 420, 18),
(111, 180,210,750, 19),
(112, 170, 150, 370, 20);


INSERT home_animals VALUES
(500, "рыжий", "лежать", 1 ),
(501, "серый", "спать", 2),
(502, "трехцветный", "кусь", 3),
(503, "черный", "ням-ням",5),
(504, "черепаховый", "спать", 6),
(505, "рыжий", "гулять",11),
(506, "черный","фас",12),
(507, "белый", "",21),
(508, "бежевый", "",22),
(509, "полосатый", "",23),
(510, "серый", "",24),
(511, "белый", "",25),
(512, "бежевый","брысь",26),
(513, "черный", "брось", 27),
(514, "черный","Сторожить",28),
(515, "палый", "фу",29),
(516, "пятнистый", "кака",30),
(517, "белый", "кусь",31),
(518, "серо-рыжий", "взять",32),
(519, "рыжий", "принеси",33),
(520, "рыжий", "лежать",34),
(521, "черно-рыжий", "умри",35),
(522, "черно-рыжий", "лапу", 36),
(523, "черный", "аппорт",37),
(524, "бело-черный", "брысь",38),
(525, "черный", "гулять",39);



Select a.*, pack.*
FROM animals a
JOIN pack_animals pack
ON a.id_animal = pack.id_animal;
-- WHERE pack.size > 140 and pack.weight <500;


INSERT camels VALUES
(201, 1, 103),
(202, 2, 106),
(203, 2,109),
(204, 1,111);


INSERT donkeys VALUES
(301,"черный", 100),
(302,"бурый", 104),
(303,"пегий", 107),
(304,"белый", 108);

INSERT hors VALUES
(400, "рыжий", 101),
(401, "вороной", 102),
(402, "гнедой", 105),
(403, "серый", 110),
(404, "чубарая", 112);

Select count(*)
FROM animals a
JOIN home_animals p
ON a.id_animal = p.id_animal;

INSERT hamsters VALUES
(600, 10, 1,507),
(601, 18, 2,508),
(602, 8, 1,509),
(603, 20, 2,510),
(604, 13, 1,511);



INSERT dogs VALUES
(700, "пинчер", 33, 500),
(701, "пудель", 45, 505),
(702, "овчарка", 60, 506),
(703, "французский бульдог", 30, 514),
(704, "бигль", 36, 515),
(705, "эрдельтерьер", 60, 518),
(706, "йорктерьер", 25, 519),
(707, "шпиц", 29, 520),
(708, "доберман", 70, 521),
(709, "дворняга", 45, 522),
(710, "ротвейлер", 62, 523),
(711, "мастиф", 66, 525);

INSERT cats VALUES
(900, "британская", 4.5, 501),
(901, "домашняя", 5.5, 502),
(902, "домашняя", 4.8, 503),
(903, "найденыш", 3.8, 504),
(904, "сфинкс", 4.0, 512),
(905, "бомбейская", 4.7, 513),
(906, "дворовая", 4.1, 516),
(907, "ангорская", 5.1, 517),
(908, "сиамский", 4.1, 524);


SELECT * FROM cats;


